app/Http/Controllers/CustomerController.php

    public function index(Request $request)
    {
        if ($request->ajax()) {
            $data = Customer::select('customer_id', 'name', 'address', 'contact_no', 'created_at', 'updated_at')
                ->get()
                ->map(function($customer) {
                    // Format dates
                    $customer->created_at = $customer->created_at->format('Y-m-d H:i:s');
                    $customer->updated_at = $customer->updated_at->format('Y-m-d H:i:s');

                    // Format contact_no to include +63 with a space
                    $customer->contact_no = str_replace('63', '+63', $customer->contact_no);

                    return $customer;
                });
---
select `customer_id`, `name`, `address`, `contact_no`, `created_at`, `updated_at` from `customer`