app/Http/Controllers/InventoryController.php

select * from `brand` where `brand`.`brand_id` in (1, 2)
select * from `category` where `category`.`category_id` in (1, 2, 3, 5)
select `product_id`, `category_id`, `brand_id`, `product_name`, `quantity`, `released_date`, `status`, `notes`, `created_at`, `updated_at` from `inventory` where `inventory`.`deleted_at` is null
---
    public function index(Request $request)
{
    if ($request->ajax()) {
        try {
            $query = Inventory::with(['category', 'brand'])
                ->select('product_id', 'category_id', 'brand_id', 'product_name', 'quantity', 'released_date', 'status', 'notes', 'created_at', 'updated_at');

            // Apply filters if they are present
            if ($request->has('category') && !empty($request->category)) {
                $query->where('category_id', $request->category);
            }

            if ($request->has('brand') && !empty($request->brand)) {
                $query->where('brand_id', $request->brand);
            }

            if ($request->has('status') && !empty($request->status)) {
                $query->where('status', $request->status);
            }

            // Optional: Include soft-deleted items
            // $query->withTrashed();

            $data = $query->get()->map(function ($inventory) {
                $inventory->notes = $inventory->notes ?? 'No notes available';
                $inventory->created_at = $inventory->created_at ? $inventory->created_at->format('Y-m-d H:i:s') : 'N/A';
                $inventory->updated_at = $inventory->updated_at ? $inventory->updated_at->format('Y-m-d H:i:s') : 'N/A';

                $inventory->category_name = $inventory->category ? $inventory->category->category_name : 'N/A';
                $inventory->brand_name = $inventory->brand ? $inventory->brand->brand_name : 'N/A';
                return $inventory;
            });

select * from `category`
select * from `brand`
---
        }
    }

    $categories = Category::all();
    $brands = Brand::all();

select * from `category`
select * from `brand`
---
    public function create()
    {
        $categories = Category::all(); // Retrieve all categories
        $brands = Brand::all(); // Retrieve all brands