app/Http/Controllers/InventoryitemController.php

select * from `inventory_item` where `inventory_item`.`product_id` in (1)
select * from `inventory` where `inventory`.`product_id` = '1' and `inventory`.`deleted_at` is null limit 1
---
        'condition' => $data['condition'],
    ]);
    session()->flash('success', 'Serial created successfully!');
    return redirect()->route('inventoryitem.serials', ['product_id' => $data['product_id']])
                     ->with('success', 'Inventory item saved successfully!');