app/Http/Controllers/ServicesController.php

delete from `service` where `service_id` = 1
---
    public function delete(Services $service){
        $service->delete();