app/Http/Controllers/TechReportController.php

select * from `inventory` where `inventory`.`product_id` = 1 and `inventory`.`deleted_at` is null limit 1
select * from `customer` where `customer`.`customer_id` in (1)
select * from `inventory_item` where `inventory_item`.`sku_id` in (1)
select * from `service` where `service`.`service_id` in (3)
---
    public function index(Request $request)
{
    if ($request->ajax()) {
        try {
            // Build the query for TechReport with relationships
            $data = TechReport::with(['TechProfile', 'customer', 'Inventoryitem', 'Services'])
                ->select('report_id', 'technician_id', 'customer_id', 'sku_id', 'service_id', 'date_of_completion', 'payment_type', 'payment_method', 'status', 'remarks', 'cost', 'created_at', 'updated_at');

            // Apply filters based on request data
            if ($request->has('paymenttype') && !empty($request->paymenttype)) {
                $data->where('payment_type', $request->paymenttype);
            }

            if ($request->has('service') && !empty($request->service)) {
                $data->where('service_id', $request->service);
            }

            if ($request->has('status') && !empty($request->status)) {
                $data->where('status', $request->status);
            }
            if ($request->has('paymentmethod') && !empty($request->paymentmethod)) {
                $data->where('payment_method', $request->paymentmethod);
            }

            // Fetch the data and map additional fields
            $data = $data->get()->map(function ($techreport) {
                // Set default values for missing fields
                $techreport->remarks = $techreport->remarks ?? 'No remarks available';
                $techreport->created_at = $techreport->created_at ? $techreport->created_at->format('yy-m-d H:i:s') : 'N/A';
                $techreport->updated_at = $techreport->updated_at ? $techreport->updated_at->format('yy-m-d H:i:s') : 'N/A';

                // Adding related fields (make sure they exist)
                $techreport->technician_name = $techreport->TechProfile ? $techreport->TechProfile->name : 'N/A';
                $techreport->customer_name = $techreport->customer ? $techreport->customer->name : 'N/A';
                $techreport->serial_number = $techreport->Inventoryitem ? $techreport->Inventoryitem->serial_number : 'N/A';
                $techreport->product_id = $techreport->Inventoryitem ? $techreport->Inventoryitem->product_id : 'N/A';
                $techreport->service_name = $techreport->Services ? $techreport->Services->service_name : 'N/A';

                // Add inventory product name if available
                $techreport->product_name = $techreport->Inventoryitem && $techreport->Inventoryitem->inventory
                    ? $techreport->Inventoryitem->inventory->product_name
                    : 'N/A';

                return $techreport;
            });

select * from `service`
---

    // For non-AJAX requests (e.g., page load)
    $techprofile = TechProfile::all();
    $service = Services::all();

select * from `inventory_item`
select * from `service`
---
  public function create()
  {
      $techprofile = TechProfile::all(); // Retrieve all technician
      $customer = customer::all(); // Retrieve all customer
      $inventoryitem = Inventoryitem::all(); // Retrieve all inventoryitem
      $service = Services::all(); // Retrieve all service

select * from `customer`
select * from `inventory_item`
select * from `service`
---
            public function edit(TechReport $techreport)
        {
            // Fetch related data for the TechReport edit form
            $techprofile = TechProfile::all(); // Retrieve all technician profiles
            $customer = Customer::all(); // Retrieve all customers
            $inventoryitem = Inventoryitem::all(); // Retrieve all inventory items
            $service = Services::all(); // Retrieve all services