app/Http/Controllers/TechReportController.php

select * from `customer`
---
  public function view(TechReport $techreport)
  {
      // Fetch related data for the TechReport edit form
      $techprofile = TechProfile::all(); // Retrieve all technician profiles
      $customer = Customer::all(); // Retrieve all customers